{
  "redirect": true,
  "nextRoute": "home",
  "contact": {
    "mail": "someTestMail@test.com",
    "vimeo": "http://www.google.de"
  },
  "preloader": {
    "id": "preloader",
    "preloadBar": "---"
  },
  "home": {
    "id": "home",
    "negative": false,
    "description": {
      "name": "MICHAEL SCHADE",
      "one": "INTERACTION",
      "two": "DESIGN",
      "scroll": "SCROLL"
    },
    "background": {
      "logo": "url(images/logo.png)",
      "nlogo": "url(images/logoNegative.png)"
    },
    "links": [
      {
        "id": "0",
        "linkName": "The Work",
        "linkPath": "/work"
      },
      {
        "id": "1",
        "linkName": "The Person",
        "linkPath": "/me"
      },
      {
        "id": "2",
        "linkName": "The Pictures",
        "linkPath": "/photography"
      }
    ]
  },
  "work": {
    "id": "work",
    "grid_items_bg": {
      "1": "url(images/01.jpg)",
      "2": "url(images/05.jpg)",
      "3": "url(images/01.jpg)",
      "4": "url(images/02.jpg)",
      "5": "url(images/01.jpg)",
      "6": "url(images/02.jpg)",
      "7": "url(images/01.jpg)",
      "8": "url(images/02.jpg)",
      "9": "url(images/01.jpg)"
    },
    "grid_items_title": {
      "1": "Musical Cubes",
      "2": "Coded Reality",
      "3": "Human&Machine",
      "4": "The Wall",
      "5": "Light Miners",
      "6": "Mu:Brace",
      "7": "Cucumbis",
      "8": "Goldmann",
      "9": "The Pictures"
    },
    "description": {
      "1": "An Interactive art installation for public spaces",
      "2": "A real-time narrative that can be influenced through neural interfaces",
      "3": "A psycho-technological theatre experiment",
      "4": "An interactive art installation mirroring the users’ movements",
      "5": "A pervasive gaming prototype",
      "6": "A wearable MIDI controller for musical expression",
      "7": "A new prototype for controlling visual presentations",
      "8": "Documentary of the electronic music artist Stefan Goldmann",
      "9": "Conceptional experimental Photography"
    },
    "links": {
      "1": "/musicalcubes",
      "2": "/codedreality",
      "3": "/humanandmachine",
      "4": "/thewall",
      "5": "/lightminers",
      "6": "/mubrace",
      "7": "/cucumbis",
      "8": "/goldmann",
      "9": "/thepictures"
    },
    "year": {
      "1": "2015",
      "2": "2015",
      "3": "2014",
      "4": "2014",
      "5": "2014",
      "6": "2013",
      "7": "2013",
      "8": "2011",
      "9": "2010"
    }
  },
  "about": {
    "0": [
      "Art",
      "Technologies",
      "Musical Applications",
      "Culture"
    ],
    "1": [
      "Interactive Installations",
      "Generative Design",
      "Performing Arts",
      "Maker Culture"
    ],
    "2": [
      "Design",
      "Visual Aesthetics",
      "Creativity",
      "Photography"
    ],
    "3": [
      "Pyhsical Computing",
      "Hardware Interfaces",
      "Tangible Interfaces",
      "Arduino",
      "Cinema4D",
      "AutoCAD",
      "3D Printing"
    ],
    "4": [
      "Creative Thinking",
      "Interaction Design",
      "Interface Design",
      "Audio-Visual Design",
      "User Experience",
      "Photoshop",
      "Illustrator",
      "InDesign",
      "AfterEffects"
    ],
    "5": [
      "Creative Coding",
      "Processing",
      "OpenFrameworks",
      "Unity",
      "Webtechnologies",
      "WebGl",
      "Html, Javascript, CSS",
      "Vue, Angular, React",
      "SASS, Gulp, Grunt",
      "C++, Java, Python"
    ]
  },
  "musicalcubes": {
    "title": "Musical Cubes",
    "route": "musicalcubes",
    "nextRoute": "codedreality",
    "titlePicture": "../images/cubes/cubes_title.jpg",
    "sections": [
      {
        "sectionColor": "#FFF",
        "sectionBg": "",
        "media": [
          {
            "type": "IMAGE",
            "src": "../images/cubes/cubes_01.jpg"
          },
          {
            "type": "IMAGE",
            "src": "../images/cubes/cubes_02.jpg"
          },
          {
            "type": "IMAGE",
            "src": "../images/cubes/cubes_03.jpg"
          },
          {
            "type": "TEXT",
            "content": "Our installation works like a collaborative step sequencer as it consists of eight interactive translucent cubes (2x4 matrix) hanging from the ceiling at a certain height. Users are able to interact by standing underneath a cube. By their presence in that space, they initiate a sound and effect the shine of coloured light as soon as the sequencer passes the cube. They can broaden the range of their possible interactive space by for example stretching their arms and thus reaching the physical space of the adjacent cubes. Through such striding movements they get the chance of interacting with several cubes at the same time.",
            "marginb": "0"
          },
          {
            "type": "IMAGE",
            "src": "../images/cubes/cubes_04.jpg"
          },
          {
            "type": "TEXT",
            "content": "The user can change the pitch of the sound by changing the distance between the cubes and their own body. A shorter distance to a cube will result in a higher pitch while a longer distance will lower it. As the pitch corresponds to the colour of the cube, this change in body posture will also change the colour. Furthermore, the user can create personalised sounds by recording his/her own voice. Shaking the cube will turn it red, and initiate the record mode. In the moment of recording, all other sounds will be muted in order to make the recording as clear as possible. When the recording is done, the sound will be unmuted and the cube switches back to normal mode.",
            "marginb": "0"
          },
          {
            "type": "IMAGE",
            "src": "../images/cubes/cubes_05.jpg"
          },
          {
            "type": "TEXT",
            "content": "If the user wants the sound to be copied to other cubes, he/she may transfer it from one cube to another by simply bringing the two cubes together. The newest sound of the two will then overwrite the older one. These different functions reflect the project's underlying intention. As the handling of the MusicalCubes is somewhat restricted if used alone, it becomes clear that the installation is intended for bringing people together in a collaborative interaction. By standing under the cubes, recording sounds and perhaps altering their distance to the cubes they can create a beat or melody together.",
            "marginb": "0"
          },
          {
            "type": "VIDEO",
            "src": "https://player.vimeo.com/video/157266155"
          },
          {
            "type": "FOOTER",
            "credits": "Gunnar Oledal & Michael Schade",
            "thanks": [
              {
                "name": "Interactive Institute",
                "src": "http://www.tii.se"
              },
              {
                "name": "and"
              },
              {
                "name": "Chalmers University",
                "src": "www.chalmers.se"
              }
            ]
          }
        ]
      }
    ]
  },
  "codedreality": {
    "title": "Coded Reality",
    "route": "codedreality",
    "nextRoute": "humanandmachine",
    "titlePicture": "../images/coded/coded_title.jpg",
    "sections": [
      {
        "sectionColor": "#FFF",
        "sectionBg": "",
        "media": [
          {
            "type": "IMAGE",
            "src": "../images/coded/coded_01.jpg"
          },
          {
            "type": "IMAGE",
            "src": "../images/coded/coded_02.jpg"
          },
          {
            "type": "TEXT",
            "content": "The influence the participants may have by putting themselves consciously in a desired mental state are different from person to person and largely depends on the BCI devices they are wearing. In our case we use several hacked toys from Neurosky, so-called Necominis. Those devices are not fulfilling scientific requirements regarding the reading of brain activity. Their technology is very simple compared to other more expensive devices on the market. Consequently, they are not delivering a 100% representation of a specific mental state or emotion. In fact, a participant might be able to change the measures of the BCIs remarkably – with a bit of training and practise."
          },
          {
            "type": "IMAGE",
            "src": "../images/coded/coded_03.jpg"
          },
          {
            "type": "IMAGE",
            "src": "../images/coded/coded_04.jpg"
          },
          {
            "type": "IMAGE",
            "src": "../images/coded/coded_05.jpg"
          },
          {
            "type": "TEXT",
            "content": "As described above we are using the hacked Necomini BCI toy to receive certain mental states. Inside the headset there is a small Arduino nano computer that is directly connected to Neurosky’s TGMA module’s serial port inside the Necomini. Additionally, the Arduino is connected to two RGB LED strips that visualise the mental state on the headset. The colour on the headset changes only when a significant change in the brainwave pattern is recognised (a threshold helps to filter additional noise), i.e. when another mental state is reached. Whenever this happens the current state is sent via UART to a computer that collects the states of all participants. Every state and the associate colour is then stored in a computer program in which a rated average of the mental state of all participants is calculated. The pyramid, which displays the decisions of all participants, is separated into three sections: bottom, middle and top. Whenever the computer program detects a new change in the mental state of the group this colour will be displayed at the bottom of the pyramid shifting the colours of the other two levels. Whenever the colour of the top section changes to another colour this has an actual influence on the story line. The change results in a little “neuron firework” running through the pyramid to the top section.",
            "marginb": "0"
          },
          {
            "type": "IMAGE",
            "src": "../images/coded/coded_06.jpg"
          },
          {
            "type": "FOOTER",
            "credits": "Robert Bolin, Michael Schade, Carl Heath, Olle Bjerkås",
            "thanks": [
              {
                "name": "Interactive Institute",
                "src": "http://www.tii.se"
              },
              {
                "name": "and"
              },
              {
                "name": "Scenlaboratoriet",
                "src": "www.scenlaboratoriet.se"
              }
            ]
          }
        ]
      }
    ]
  },
  "humanandmachine": {
    "title": "Human and Machine",
    "route": "humanandmachine",
    "nextRoute": "thewall",
    "titlePicture": "../images/human/human_title.jpg",
    "sections": [
      {
        "sectionColor": "#FFF",
        "sectionBg": "",
        "media": [
          {
            "type": "IMAGE",
            "src": "../images/human/human_01.jpg"
          },
          {
            "type": "IMAGE",
            "src": "../images/human/human_02.jpg"
          },
          {
            "type": "IMAGE",
            "src": "../images/human/human_03.jpg"
          },
          {
            "type": "TEXT",
            "content": "In the final concept of the <i>Human and Machine</i> system the actor indirectly controls the robot via his body signals: Different sensors measure his/her spacial position, heart-rate and brain activity. During the entire theatre performance the system will be controlled by a technician with the exception of individual parts in which the robot reacts and speaks only according to the sensor data. The controls for the technician as well as the sensor data are visualized during the entire performance to give the technician and the actor a visual response but also to enrich the experience for the audience as they get a better impression of what happens on stage. Additionally, an illumination system is installed at the robot's two parts, arm and truss, to dynamically integrate the stage environment into the performance. The final implementation of the <i>Human and Machine</i> system contains several different parts of software and hardware. These parts are responsible for controlling the robot, the sensors, the stage environment and the cue system:",
            "marginb": "0"
          },
          {
            "type": "IMAGE",
            "src": "../images/human/human_04.jpg"
          },
          {
            "type": "IMAGE",
            "src": "../images/human/human_05.jpg"
          },
          {
            "type": "VIDEO",
            "src": "https://player.vimeo.com/video/111928485"
          },
          {
            "type": "FOOTER",
            "credits": "Robert Bolin, Michael Schade, Carl Heath",
            "thanks": [
              {
                "name": "Interactive Institute",
                "src": "http://www.tii.se"
              },
              {
                "name": "and"
              },
              {
                "name": "Scenlaboratoriet",
                "src": "www.scenlaboratoriet.se"
              }
            ]
          }
        ]
      }
    ]
  },
  "thewall": {
    "title": "The Wall",
    "route": "thewall",
    "nextRoute": "lightminers",
    "titlePicture": "../images/wall/wall_title.jpg",
    "sections": [
      {
        "sectionColor": "#FFF",
        "sectionBg": "",
        "media": [
          {
            "type": "IMAGE",
            "src": "../images/wall/wall_01.jpg"
          },
          {
            "type": "IMAGE",
            "src": "../images/wall/wall_02.jpg"
          },
          {
            "type": "IMAGE",
            "src": "../images/wall/wall_03.jpg"
          },
          {
            "type": "VIDEO",
            "src": "https://player.vimeo.com/video/166879605"
          },
          {
            "type": "FOOTER",
            "credits": "Alessandro Suraci, Michael Schade, David Schneller, Andrea Amodeo, Gunnar Oledal",
            "thanks": [
              {
                "name": "Interactive Institute",
                "src": "http://www.tii.se"
              },
              {
                "name": "and"
              },
              {
                "name": "Chalmers University",
                "src": "www.chalmers.se"
              }
            ]
          }
        ]
      }
    ]
  },
  "lightminers": {
    "title": "Lightminers",
    "route": "lightminers",
    "nextRoute": "mubrace",
    "titlePicture": "../images/light/light_title.jpg",
    "sections": [
      {
        "sectionColor": "#FFF",
        "sectionBg": "",
        "media": [
          {
            "type": "IMAGE",
            "src": "../images/light/light_01.jpg"
          },
          {
            "type": "IMAGE",
            "src": "../images/light/light_02.jpg"
          },
          {
            "type": "IMAGE",
            "src": "../images/light/light_03.jpg"
          },
          {
            "type": "VIDEO",
            "src": "https://player.vimeo.com/video/111941679"
          },
          {
            "type": "FOOTER",
            "credits": "Carolin Poelk, Jacky Forzelius, David Schneller, Michael Schade",
            "thanks": [
              {
                "name": "Interactive Institute",
                "src": "http://www.tii.se"
              },
              {
                "name": "in collaboration with"
              },
              {
                "name": "Experimedia",
                "src": "http://www.experimedia.eu/"
              }
            ]
          }
        ]
      }
    ]
  },
  "mubrace": {
    "title": "Mu:brace",
    "route": "mubrace",
    "nextRoute": "cucumbis",
    "titlePicture": "../images/mubrace/mubrace_title.jpg",
    "sections": [
      {
        "sectionColor": "#FFF",
        "sectionBg": "",
        "media": [
          {
            "type": "IMAGE",
            "src": "../images/mubrace/mubrace_01.jpg"
          },
          {
            "type": "TEXT",
            "content": "The heart of the <i>Mu:Brace</i> prototype is a Teensy 3.0 microcontroller which has a small physical size and the advantage of native support for USBMIDI. By this, it allows for an easy communication with different music programs. All the hardware is fitted into a custom 3D printed casing made from ABS plastic. Some of the contained Mu:Brace hardware and technical features are described in the following:",
            "marginb": "0"
          },
          {
            "type": "IMAGE",
            "src": "../images/mubrace/mubrace_02.jpg"
          },
          {
            "type": "TEXT",
            "content": "<b>Rotary Encoders and Buttons:</b> The rotary knobs of the Mu:Brace are encoders which can rotate endlessly. This property has the disadvantage that the user does not get tactile feedback when a minimum or maximum value is reached. On the other hand this allows for realtime remapping of the encoder input to different parameters without value jumps. By using visual feedback such as a LED graph, the problem with feedback of minimum and maximum limits can be reduced.<br><br><b>Visualizing the Input Given by the User:</b> To give the user visual feedback when using the different interaction techniques, a LED bar can be used to show changes of parameter values. This is especiallz useful for animated values or parameters that are controlled by sensors that don’t give tactile feedback (as described above).",
            "marginb": "0"
          },
          {
            "type": "IMAGE",
            "src": "../images/mubrace/mubrace_03.jpg"
          },
          {
            "type": "TEXT",
            "content": "<b>Swipe guesture:</b> With the use of two IRproximity sensors it is possible to implement a hand swipe interaction. By measuring the time between coverage of the IRsensors it is possible to initiate a parameter “animation” that is affected by the direction and speed of the hand’s movements. The parameter controlled by the swipe can be animated in many ways. One way is to let the parameter value travel depending on the speed and direction of the swipe and then let it slow down to settle on a value. With this method the user can smoothly increase or decrease the value by repeatedly swiping his hand. Another possibility for the swipe is to let the animation travel from a predetermined value in a direction and distance dependent on the swipe. Then the value smoothly returns to its default value. The advantage of this animation is that the user doesn’t have to worry about the current parameter value, since it will always return to the same default.<br><br><b>Distance Sensing:</b> In addition to the swipe feature described above we can use an IRsensor to create an interaction similar to that of a theremin, where the distance from the hand to the sensor controls the output parameter.",
            "marginb": "0"
          },
          {
            "type": "IMAGE",
            "src": "../images/mubrace/mubrace_04.jpg"
          },
          {
            "type": "TEXT",
            "content": "<b>Orientation in Three-Dimensional Space:</b> An IMU (Inertial Measurement Unit) can be used to measure orientation in three dimensions. This allows for an interaction where three parameters are controlled at the same time, by turning the IMU in different directions (roll, pitch, yaw).<br><br><b>Accelerometer Threshold Triggering:</b> By only using the accelerometer of IMU the proper acceleration can be measured. By setting a threshold it is possible to trigger certain parameter changes by rapidly moving the accelerometer. For example, this could be used to trigger drum sounds by creating beats with the hand in the air.",
            "marginb": "0"
          },
          {
            "type": "VIDEO",
            "src": "https://player.vimeo.com/video/111922335"
          },
          {
            "type": "FOOTER",
            "credits": "Gunnar Oledal, Michael Schade",
            "thanks": [
              {
                "name": "Interactive Institute",
                "src": "http://www.tii.se"
              }
            ]
          }
        ]
      }
    ]
  },
  "cucumbis": {
    "title": "Cucumbis",
    "route": "cucumbis",
    "nextRoute": "goldmann",
    "titlePicture": "../images/cucumbis/cucumbis_title.jpg",
    "sections": [
      {
        "sectionColor": "#FFF",
        "sectionBg": "",
        "media": [
          {
            "type": "IMAGE",
            "src": "../images/cucumbis/cucumbis_01.jpg"
          },
          {
            "type": "IMAGE",
            "src": "../images/cucumbis/cucumbis_02.jpg"
          },
          {
            "type": "IMAGE",
            "src": "../images/cucumbis/cucumbis_03.jpg"
          },
          {
            "type": "IMAGE",
            "src": "../images/cucumbis/cucumbis_04.jpg"
          },
          {
            "type": "IMAGE",
            "src": "../images/cucumbis/cucumbis_05.jpg"
          },
          {
            "type": "VIDEO",
            "src": "https://player.vimeo.com/video/157275463"
          },
          {
            "type": "FOOTER",
            "credits": "David Schneller, Michael Schade, Sebastian Ilves",
            "thanks": [
              {
                "name": "Chalmers University",
                "src": "http://www.chalmers.se"
              }
            ]
          }
        ]
      }
    ]
  },
  "goldmann": {
    "title": "Goldmann",
    "route": "goldmann",
    "nextRoute": "thepictures",
    "titlePicture": "../images/goldmann/goldmann_title.jpg",
    "sections": [
      {
        "sectionColor": "#FFF",
        "sectionBg": "",
        "media": [
          {
            "type": "IMAGE",
            "src": "../images/goldmann/goldmann_01.jpg"
          },
          {
            "type": "IMAGE",
            "src": "../images/goldmann/goldmann_02.jpg"
          },
          {
            "type": "IMAGE",
            "src": "../images/goldmann/goldmann_03.jpg"
          },
          {
            "type": "IMAGE",
            "src": "../images/goldmann/goldmann_04.jpg"
          },
          {
            "type": "VIDEO",
            "src": "https://player.vimeo.com/video/169292345"
          },
          {
            "type": "FOOTER",
            "credits": "Thomas Kipke, Michael Schade",
            "thanks": [
              {
                "name": "Duplex and Masters, Soju Bar, HardWaxx"
              }
            ]
          }
        ]
      }
    ]
  },
  "thepictures": {
    "title": "The Pictures",
    "route": "thepictures",
    "nextRoute": "home",
    "titlePicture": "../images/pictures/pictures_title.jpg",
    "sections": [
      {
        "sectionColor": "#FFF",
        "sectionBg": "",
        "media": [
          {
            "type": "IMAGE",
            "src": "../images/pictures/pictures_01.jpg"
          },
          {
            "type": "IMAGE",
            "src": "../images/pictures/pictures_02.jpg"
          },
          {
            "type": "IMAGE",
            "src": "../images/pictures/pictures_03.jpg"
          },
          {
            "type": "IMAGE",
            "src": "../images/pictures/pictures_04.jpg"
          },
          {
            "type": "FOOTER",
            "credits": "Michael Schade"
          }
        ]
      }
    ]
  }
}
